# ---------------------------------------------------------------- #
# 2022-08-30 1차 다변량 분석 강의 
# 
# 강의 소개
# 1. R 언어를 다룰 줄 알아야한다.
# 2. 다변량 분석에 해당하는 통계 분석의 기법을 다룰 예정이다.
# 3. 다중 회귀 분석을 깊게 다룰 예정이다.
# 4. input : 독립변수(다양하게 존재하다), output : 종속 변수
# 5. 중요한 변수를 골라내는 과정 : 변수 선택법
# 6. 회귀 분석 원리를 배울 것이다.
# 7. 주성분 분석 PCA 기법을 공부할 예정이다.
# 8. 로지스틱 회귀(분류 범주) 분석, 다중 회귀 분석 차이!!
#                                                 - 김재윤 교수님 -  
# 중요 포인트
# 1. 다중회귀분석
# 2. 로지스틱 회귀 분석
# 3. PCA 주성분 분석
# 4. 일반화 선형 모형
# 5. 라소 릿지 리그레션
# 6. 상관성 분석
# 7. 과제를 잘해서 플러스 점수는 없다.
# 8. 이메일로 전문을 보내는 것이 좋다.
# 9. 실습 형태로 오픈북으로 시험을 본다.
# 10.수업자료 인터넷 상관없이 문제를 풀 수있다.
# 11. 문제지를 PPT 형태로 주는데 그 문제들을 실습의 형태로 문제를 푼다.
# 12. OX문제도 나올 수 있다.
# 13. 시험보는 동안에 공부를 하지 말자 ㅜㅜ
# 14. 미리 공부하고 실습도 많이 해보고 코드도 작성해서 가져올 수 있다.
# 15. 교재는 따로 없다. (PPT 사용)
# 16. 과제가 많아요 ㅜㅜ
# ---------------------------------------------------------------- #