# ---------------------------------------------------------------- #
# 2022-11-01 (화요일) 10주차 1주
# 내용 : 다중 공선성 (multicollinearity)
#                                                 - 김재윤 교수님 -  
# ---------------------------------------------------------------- #

# 다중 공선성이란?
# - 독립(설명)변수들 간에 강한 상관관계가 존재하는 경우
# - 즉, 독립변수들 간의 상관관계가 높아 회귀분석의 전제조건을 위해

# 전진 후진 step 와이즈
# 변수 제거하는 선택법에서 다룬 내용이다.


# vif 함수 이용
# install.packages("car")
library(MASS)
library(car)

data <- MASS::Boston

data_ln_vif <- lm(medv ~ ., data = data[,-4])
# Call:
#   lm(formula = medv ~ ., data = data[, -4])
# 
# Coefficients:
#   (Intercept)         crim           zn        indus          nox           rm  
# 36.891960    -0.113139     0.047052     0.040311   -17.366999     3.850492  
# age          dis          rad          tax      ptratio        black  
# 0.002784    -1.485374     0.328311    -0.013756    -0.990958     0.009741  
# lstat  
# -0.534158  

vif(data_ln_vif)
# crim       zn    indus      nox       rm      age      dis      rad      tax 
# 1.787705 2.298257 3.949246 4.388775 1.931865 3.092832 3.954961 7.397844 8.876233 
# ptratio    black    lstat 
# 1.783302 1.344971 2.931101 


summary(data_ln_vif)
# Call:
#   lm(formula = medv ~ ., data = data[, -4])
# 
# Residuals:
#   Min       1Q   Median       3Q      Max 
# -13.3968  -2.8103  -0.6455   1.9141  26.3755 
# 
# Coefficients:
#   Estimate Std. Error t value Pr(>|t|)    
# (Intercept)  36.891960   5.146516   7.168 2.79e-12 ***
#   crim         -0.113139   0.033113  -3.417 0.000686 ***
#   zn            0.047052   0.013847   3.398 0.000734 ***
#   indus         0.040311   0.061707   0.653 0.513889    
#   nox         -17.366999   3.851224  -4.509 8.13e-06 ***
#   rm            3.850492   0.421402   9.137  < 2e-16 ***
#   age           0.002784   0.013309   0.209 0.834407    
#   dis          -1.485374   0.201187  -7.383 6.64e-13 ***
#   rad           0.328311   0.066542   4.934 1.10e-06 ***
#   tax          -0.013756   0.003766  -3.653 0.000287 ***
#   ptratio      -0.990958   0















